backend/test/performance/artillery-test.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 10
      name: 'Warm up'
    - duration: 300
      arrivalRate: 50
      name: 'Sustained load'
    - duration: 60
      arrivalRate: 100
      name: 'Peak load'
  defaults:
    headers:
      Content-Type: 'application/json'
  processor: './artillery-processor.js'

scenarios:
  - name: 'Health check'
    weight: 20
    flow:
      - get:
          url: '/api/health'
      - think: 1

  - name: 'List captures'
    weight: 30
    flow:
      - get:
          url: '/api/captures'
          capture:
            json: '$.captures'
            as: 'captures'
      - think: 2

  - name: 'Get subscription'
    weight: 20
    flow:
      - get:
          url: '/api/subscription'
      - think: 1

  - name: 'Upload image (simulated)'
    weight: 30
    flow:
      - post:
          url: '/api/upload/image'
          json:
            dataUrl: 'data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAAAEAAAABCAYAAAAfFcSJAAAADUlEQVR42mNk+M9QDwADhgGAWjR9awAAAABJRU5ErkJggg=='
            type: 'image'
      - think: 3